{
  "class_name": "Sequential",
  "config": {
    "name": "sequential_1",
    "layers": [
      {
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [null, 100, 100, 1],
          "dtype": "float32",
          "sparse": false,
          "ragged": false,
          "name": "model_1_input"
        }
      },
      {
        "class_name": "Functional",
        "config": {
          "name": "model_1",
          "trainable": true,
          "layers": [
            {
              "class_name": "InputLayer",
              "config": {
                "batch_input_shape": [null, 100, 100, 1],
                "dtype": "float32",
                "sparse": false,
                "ragged": false,
                "name": "input_2"
              },
              "name": "input_2",
              "inbound_nodes": []
            },
            {
              "class_name": "Conv2D",
              "config": {
                "name": "conv2d_5",
                "trainable": true,
                "dtype": "float32",
                "batch_input_shape": [null, 100, 100, 1],
                "filters": 128,
                "kernel_size": [3, 3],
                "strides": [1, 1],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [1, 1],
                "groups": 1,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": { "seed": null }
                },
                "bias_initializer": { "class_name": "Zeros", "config": {} },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              },
              "name": "conv2d_5",
              "inbound_nodes": [[["input_2", 0, 0, {}]]]
            },
            {
              "class_name": "Conv2D",
              "config": {
                "name": "conv2d_6",
                "trainable": true,
                "dtype": "float32",
                "batch_input_shape": [null, 100, 100, 1],
                "filters": 128,
                "kernel_size": [5, 5],
                "strides": [1, 1],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [1, 1],
                "groups": 1,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": { "seed": null }
                },
                "bias_initializer": { "class_name": "Zeros", "config": {} },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              },
              "name": "conv2d_6",
              "inbound_nodes": [[["input_2", 0, 0, {}]]]
            },
            {
              "class_name": "Conv2D",
              "config": {
                "name": "conv2d_7",
                "trainable": true,
                "dtype": "float32",
                "batch_input_shape": [null, 100, 100, 1],
                "filters": 128,
                "kernel_size": [7, 7],
                "strides": [1, 1],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [1, 1],
                "groups": 1,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": { "seed": null }
                },
                "bias_initializer": { "class_name": "Zeros", "config": {} },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              },
              "name": "conv2d_7",
              "inbound_nodes": [[["input_2", 0, 0, {}]]]
            },
            {
              "class_name": "Concatenate",
              "config": {
                "name": "concatenate_1",
                "trainable": true,
                "dtype": "float32",
                "axis": -1
              },
              "name": "concatenate_1",
              "inbound_nodes": [
                [
                  ["conv2d_5", 0, 0, {}],
                  ["conv2d_6", 0, 0, {}],
                  ["conv2d_7", 0, 0, {}]
                ]
              ]
            }
          ],
          "input_layers": [["input_2", 0, 0]],
          "output_layers": [["concatenate_1", 0, 0]]
        }
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_8",
          "trainable": true,
          "dtype": "float32",
          "filters": 64,
          "kernel_size": [3, 3],
          "strides": [1, 1],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "groups": 1,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": { "seed": null }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "Activation",
        "config": {
          "name": "activation_2",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        }
      },
      {
        "class_name": "MaxPooling2D",
        "config": {
          "name": "max_pooling2d_2",
          "trainable": true,
          "dtype": "float32",
          "pool_size": [2, 2],
          "padding": "valid",
          "strides": [2, 2],
          "data_format": "channels_last"
        }
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_9",
          "trainable": true,
          "dtype": "float32",
          "filters": 32,
          "kernel_size": [3, 3],
          "strides": [1, 1],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "groups": 1,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": { "seed": null }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "Activation",
        "config": {
          "name": "activation_3",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        }
      },
      {
        "class_name": "MaxPooling2D",
        "config": {
          "name": "max_pooling2d_3",
          "trainable": true,
          "dtype": "float32",
          "pool_size": [2, 2],
          "padding": "valid",
          "strides": [2, 2],
          "data_format": "channels_last"
        }
      },
      {
        "class_name": "Flatten",
        "config": {
          "name": "flatten_1",
          "trainable": true,
          "dtype": "float32",
          "data_format": "channels_last"
        }
      },
      {
        "class_name": "Dropout",
        "config": {
          "name": "dropout_3",
          "trainable": true,
          "dtype": "float32",
          "rate": 0.5,
          "noise_shape": null,
          "seed": null
        }
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_3",
          "trainable": true,
          "dtype": "float32",
          "units": 128,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": { "seed": null }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "Dropout",
        "config": {
          "name": "dropout_4",
          "trainable": true,
          "dtype": "float32",
          "rate": 0.5,
          "noise_shape": null,
          "seed": null
        }
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_4",
          "trainable": true,
          "dtype": "float32",
          "units": 64,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": { "seed": null }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "Dropout",
        "config": {
          "name": "dropout_5",
          "trainable": true,
          "dtype": "float32",
          "rate": 0.5,
          "noise_shape": null,
          "seed": null
        }
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_5",
          "trainable": true,
          "dtype": "float32",
          "batch_input_shape": [null, 128],
          "units": 2,
          "activation": "softmax",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": { "seed": null }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      }
    ]
  },
  "keras_version": "2.12.0",
  "backend": "tensorflow"
}
